/*
70. 爬楼梯
简单
相关标签
premium lock icon
相关企业
提示
假设你正在爬楼梯。需要 n 阶你才能到达楼顶。

每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？

示例 1：

输入：n = 2
输出：2
解释：有两种方法可以爬到楼顶。
1. 1 阶 + 1 阶
2. 2 阶
示例 2：

输入：n = 3
输出：3
解释：有三种方法可以爬到楼顶。
1. 1 阶 + 1 阶 + 1 阶
2. 1 阶 + 2 阶
3. 2 阶 + 1 阶


提示：

1 <= n <= 45
*/

// 第n层到达首先需要到达第n-1层或n-2层，然后分别迈1步或2步上去。
// 那么到达n层的这个大问题就就拆成了分别到达n-1和n-2层的小问题，

#include <vector>

int climbStairs(int n) {
    if (n == 1)
        return 1;
    if (n == 2)
        return 2;
    std::vector<int> dp(n + 1);
    dp[0] = 1, dp[1] = 1, dp[2] = 2;
    for (int i = 3; i <= n; i++) {
        dp[i] = dp[i - 1] + dp[i - 2];
    }
    return dp.back();
}

int main() {}